---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartPatNo
source: html/369f7363-2630-9ab0-cb60-2d1397c05dcc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartPatNo Property

"Part Pattern Number"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartPatNo { get; }
```